import { Component } from '@angular/core';
import { QuestionComponent } from "../../common-ui/question/question.component";

@Component({
  selector: 'app-qa',
  imports: [QuestionComponent],
  templateUrl: './qa.component.html',
  styleUrl: './qa.component.scss'
})
export class QAComponent {
  questionData1 = {id: 1, head: 'Подтверждено: сознание наших соотечественников не замутнено пропагандой?', text: 'В частности, дальнейшее развитие различных форм деятельности позволяет выполнить важные задания по разработке дальнейших направлений развития. Предварительные выводы неутешительны: экономическая повестка сегодняшнего дня говорит о возможностях существующих финансовых и административных условий.'}
  questionData2 = {id: 2, head: 'Прототип нового сервиса - это как трубный призыв?', text: 'В частности, дальнейшее развитие различных форм деятельности позволяет выполнить важные задания по разработке дальнейших направлений развития. Предварительные выводы неутешительны: экономическая повестка сегодняшнего дня говорит о возможностях существующих финансовых и административных условий.'}
  questionData3 = {id: 3, head: 'Частокол на границе продолжает удивлять?', text: 'В частности, дальнейшее развитие различных форм деятельности позволяет выполнить важные задания по разработке дальнейших направлений развития. Предварительные выводы неутешительны: экономическая повестка сегодняшнего дня говорит о возможностях существующих финансовых и административных условий.'}
  questionData4 = {id: 4, head: 'Очевидцы сообщают, что слышали грохот грома градущих изменений?', text: 'В частности, дальнейшее развитие различных форм деятельности позволяет выполнить важные задания по разработке дальнейших направлений развития. Предварительные выводы неутешительны: экономическая повестка сегодняшнего дня говорит о возможностях существующих финансовых и административных условий.'}
  questionData5 = {id: 5, head: 'И по сей день в центральных регионах звучит перекатами печальный плач оппозиции?', text: 'В частности, дальнейшее развитие различных форм деятельности позволяет выполнить важные задания по разработке дальнейших направлений развития. Предварительные выводы неутешительны: экономическая повестка сегодняшнего дня говорит о возможностях существующих финансовых и административных условий.'}
  questionData6 = {id: 6, head: 'Нынче никто не может себе позволить инициировать треск разлетающихся скреп?', text: 'В частности, дальнейшее развитие различных форм деятельности позволяет выполнить важные задания по разработке дальнейших направлений развития. Предварительные выводы неутешительны: экономическая повестка сегодняшнего дня говорит о возможностях существующих финансовых и административных условий.'}
  questionData7 = {id: 7, head: 'Высококачественный прототип будущего проекта обнадёживает?', text: 'В частности, дальнейшее развитие различных форм деятельности позволяет выполнить важные задания по разработке дальнейших направлений развития. Предварительные выводы неутешительны: экономическая повестка сегодняшнего дня говорит о возможностях существующих финансовых и административных условий.'}

}
